JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_spi_driver.c
	if (state != SPI_BUSY_IN_TX)
	{
		// --- THE FIX: Validate 16-bit length ---
		// If Data Size (DS) is configured for 16-bit (0xF)
		if ((pSPIHandle->pSPIx->CR2 & (0xF << SPI_CR2_DS)) == (0xF << SPI_CR2_DS))
		{
			// The length MUST be an even number of bytes. If it's odd, reject the job!
			if (Len % 2 != 0)
			{
				return 1; // Return 1 (Transfer Rejected) due to invalid length
			}
		}

		// 1. Save the Tx buffer address and Len information in global handle
		pSPIHandle->pTxBuffer = pTxBuffer;
		pSPIHandle->TxLen = Len;

		// 2. Mark the SPI state as busy in transmission
		pSPIHandle->TxState = SPI_BUSY_IN_TX;

		// 3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set
		pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_TXEIE);

        return 0; // Return 0 to indicate SUCCESS (Transfer Accepted)
	}

	return 1; // Return 1 to indicate BUSY (Transfer Rejected)
}



/*********************************************************************
 * @fn      		- SPI_ReceiveDataIT
 *
 * @brief           - Initializes a non-blocking (interrupt-driven)
 * SPI data reception.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 * @param[in]		- pRxBuffer: Pointer to the buffer to store received data
 * @param[in]		- Len: Number of bytes to be received
 *
 * @return			- uint8_t: 0 for SUCCESS (Transfer accepted)
 * 1 for BUSY (Transfer rejected)
 *
 * @note			- This function sets up the state and enables the
 * RXNE interrupt. The actual data reception happens
 * in the background within the ISR.
 *********************************************************************/
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer, uint32_t Len)
{
	uint8_t state = pSPIHandle->RxState;

	if (state != SPI_BUSY_IN_RX)
	{
		// --- THE FIX: Validate 16-bit length ---
		// If Data Size (DS) is configured for 16-bit (0xF)
		if ((pSPIHandle->pSPIx->CR2 & (0xF << SPI_CR2_DS)) == (0xF << SPI_CR2_DS))
		{
			// The length MUST be an even number of bytes. If it's odd, reject the job!
			if (Len % 2 != 0)
			{
				return 1; // Return 1 (Transfer Rejected) due to invalid length
			}
		}

		// 1. Save the Rx buffer address and Len information in global handle
		pSPIHandle->pRxBuffer = pRxBuffer;
		pSPIHandle->RxLen = Len;

		// 2. Mark the SPI state as busy in reception
		pSPIHandle->RxState = SPI_BUSY_IN_RX;

		// 3. Enable the RXNEIE control bit to get interrupt whenever RXNE flag is set
		pSPIHandle->pSPIx->CR2 |= (1 << SPI_CR2_RXNEIE);

        return 0; // Return 0 to indicate SUCCESS (Transfer Accepted)
	}

	return 1; // Return 1 to indicate BUSY (Transfer Rejected)
}



/*********************************************************************
 * @fn      		- SPI_IRQHandling
 *
 * @brief           - Dispatches SPI interrupts to the appropriate worker
 * function based on which flag triggered the ISR.
 *
 * @param[in]		- pHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- This function acts as the "traffic cop" and should
 * be called from the actual SPIx_IRQHandler()
 * inside your main application.
 *********************************************************************/
void SPI_IRQHandling(SPI_Handle_t *pHandle)
{
	uint8_t temp1, temp2;
	// Check for TXE
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_TXE);
	temp2 = pHandle->pSPIx->CR2 & (1 << SPI_CR2_TXEIE);

	if (temp1 && temp2)
	{
		// handle TXE
		spi_txe_interrupt_handle(pHandle);
	}

	// check for RXNE
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_RXNE);
	temp2 = pHandle->pSPIx->CR2 & (1 << SPI_CR2_RXNEIE);

	if (temp1 && temp2)
	{
		// handle RXNE
		spi_rxne_interrupt_handle(pHandle);
	}

	// check for OVR flag
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_OVR);
	temp2 = pHandle->pSPIx->CR2 & (1 << SPI_CR2_ERRIE);

	if (temp1 && temp2)
	{
		// handle OVR error
		spi_ovr_err_interrupt_handle(pHandle);
	}
}



/*********************************************************************
 * @fn      		- SPI_IRQInterruptConfig
 *
 * @brief           - Configures the NVIC to enable or disable interrupts
 * for a specific IRQ number.
 *
 * @param[in]		- IRQNumber: IRQ number of the interrupt
 * @param[in]		- EnorDi: ENABLE or DISABLE macro
 *
 * @return			- none
 *********************************************************************/
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if (EnorDi == ENABLE)
	{
		if (IRQNumber <= 31)
		{
			// program ISER0 register (Interrupt Set-Enable Register 0)
			*NVIC_ISER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// program ISER1 register
			*NVIC_ISER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// program ISER2 register
			*NVIC_ISER2 |= (1 << (IRQNumber % 32));
		}
	}
	else
	{
		if (IRQNumber <= 31)
		{
			// program ICER0 register (Interrupt Clear-Enable Register 0)
			*NVIC_ICER0 |= (1 << IRQNumber);
		}
		else if (IRQNumber > 31 && IRQNumber < 64)
		{
			// program ICER1 register
			*NVIC_ICER1 |= (1 << (IRQNumber % 32));
		}
		else if (IRQNumber >= 64 && IRQNumber < 96)
		{
			// program ICER2 register
			*NVIC_ICER2 |= (1 << (IRQNumber % 32));
		}
	}
}



/*********************************************************************
 * @fn      		- SPI_IRQPriorityConfig
 *
 * @brief           - Configures the NVIC interrupt priority for a
 * specific IRQ number.
 *
 * @param[in]		- IRQNumber: IRQ number of the interrupt
 * @param[in]		- IRQPriority: Priority level to be set
 *
 * @return			- none
 *********************************************************************/
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	// 1. First let's find out the IPR (Interrupt Priority Register)
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section  = IRQNumber % 4;

	// 2. Calculate the shift amount.
    // The lower 4 bits are not implemented in STM32, so we shift by (8 - 4) = 4 bits
	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);

	*(NVIC_PR_BASE_ADDR + iprx) |= (IRQPriority << shift_amount);
}



