JuiceBeMyName/STM32-Projects/drivers/Src/stm32l47xxx_spi_driver.c
// Some helper function implementations
/*********************************************************************
 * @fn      		- spi_txe_interrupt_handle
 *
 * @brief           - Internal helper function to handle pushing the next
 * byte/word into the Data Register during an interrupt.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- Automatically closes transmission when finished.
 *********************************************************************/
static void spi_txe_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	// 2. Check the DS (Data Size) bits in CR2
	// If the 4 bits starting at SPI_CR2_DS equal 1111 (0xF), it's 16-bit
	if ((pSPIHandle->pSPIx->CR2 & (0xF << SPI_CR2_DS)) == (0xF << SPI_CR2_DS))
	{
		// 16 bit DFF
		// 1. Load the data into the DR
		// Load 2 bytes of data into the DR
		pSPIHandle->pSPIx->DR = *((uint16_t*)pSPIHandle->pTxBuffer);

		pSPIHandle->TxLen -= 2;	// decrement by 2 bytes
		pSPIHandle->pTxBuffer += 2;	// move pointer by 2 bytes
	} else
	{
		*((__vo uint8_t *) &pSPIHandle->pSPIx->DR) = *pSPIHandle->pTxBuffer;	// volatile needed cause compiler would delete all the writes to the same memory address like her DR address

		pSPIHandle->TxLen--;	// decrement length by 1 byte
		pSPIHandle->pTxBuffer++;	// Move the pointer forward by 1 byte
	}

	if (!pSPIHandle->TxLen)	// TxLen = 0 means entire message has been sent
	{
		// TxLen is zero, so close the SPI transmission and inform the application that TX is over
		// This prevents interrupts from setting up of the TXE flag
		SPI_CloseTransmission(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_TX_CMPLT);
	}
}



/*********************************************************************
 * @fn      		- spi_rxne_interrupt_handle
 *
 * @brief           - Internal helper function to handle popping the next
 * byte/word out of the Data Register during an interrupt.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- Automatically closes reception when finished.
 *********************************************************************/
static void spi_rxne_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	// 1. Check the DS (Data Size) bits in CR2 for STM32L4
	if ((pSPIHandle->pSPIx->CR2 & (0xF << SPI_CR2_DS)) == (0xF << SPI_CR2_DS))
	{
		// --- 16 BIT RECEIVE ---
		*((uint16_t *)pSPIHandle->pRxBuffer) = (uint16_t)pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen -= 2;
		pSPIHandle->pRxBuffer += 2; // FIXED: Move forward in memory
	}
    else
	{
		// --- 8 BIT RECEIVE ---
        // FIXED: Force hardware to only pop 1 byte out of the receive FIFO
		*pSPIHandle->pRxBuffer = *((__vo uint8_t *)&pSPIHandle->pSPIx->DR);
		pSPIHandle->RxLen--;
		pSPIHandle->pRxBuffer++;    // FIXED: Move forward in memory
	}

	if (!pSPIHandle->RxLen)
	{
		SPI_CloseReception(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_RX_CMPLT);
	}
}



/*********************************************************************
 * @fn      		- spi_ovr_err_interrupt_handle
 *
 * @brief           - Internal helper function to clear an Overrun Error.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- Triggers the application callback to inform the
 * user that data was permanently lost.
 *********************************************************************/
static void spi_ovr_err_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	uint8_t temp = 0;

	// 1. Clear the OVR flag
	// We only clear it automatically if we are not currently transmitting
	// If we're busy transmitting, the application will clear it later
	if (pSPIHandle->TxState != SPI_BUSY_IN_TX)
	{
		// The STM32 hardware requires a read of DR followed by a read of SR to clear the OVR bit
		temp = pSPIHandle->pSPIx->DR;
		temp = pSPIHandle->pSPIx->SR;
	}
	(void)temp;	// This casts the variable to void so the compiler doesn't complain about an "unused variable"

	// 2. Inform the application
	SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_OVR_ERR);
}



/*********************************************************************
 * @fn      		- SPI_ClearOVRFlag
 *
 * @brief           - Manually clears the Overrun (OVR) flag.
 *
 * @param[in]		- pSPIx: Base address of the SPI peripheral
 *
 * @return			- none
 *
 * @note			- Exposed for application-level error recovery.
 *********************************************************************/
void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx)
{
	uint8_t temp;
	temp = pSPIx->DR;
	temp = pSPIx->SR;
	(void)temp;
}



/*********************************************************************
 * @fn      		- SPI_CloseTransmission
 *
 * @brief           - Safely aborts or finalizes an active SPI transmission.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- Disables the TXE interrupt and resets the state.
 *********************************************************************/
void SPI_CloseTransmission(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1 << SPI_CR2_TXEIE);
	pSPIHandle->pTxBuffer = NULL;
	pSPIHandle->TxLen = 0;
	pSPIHandle->TxState = SPI_READY;
}



/*********************************************************************
 * @fn      		- SPI_CloseReception
 *
 * @brief           - Safely aborts or finalizes an active SPI reception.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 *
 * @return			- none
 *
 * @note			- Disables the RXNE interrupt and resets the state.
 *********************************************************************/
void SPI_CloseReception(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1 << SPI_CR2_RXNEIE);
	pSPIHandle->pRxBuffer = NULL;
	pSPIHandle->RxLen = 0;
	pSPIHandle->RxState = SPI_READY;
}



/*********************************************************************
 * @fn      		- SPI_ApplicationEventCallback
 *
 * @brief           - Application-level callback function for SPI events.
 *
 * @param[in]		- pSPIHandle: Pointer to the SPI handle structure
 * @param[in]		- AppEv: The event macro (e.g., SPI_EVENT_TX_CMPLT)
 *
 * @return			- none
 *
 * @note			- This is a __weak implementation. The user is expected
 * to write their own version of this function inside
 * their main.c application code to react to events.
 *********************************************************************/
__weak void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEv)
{

}
